In [3]:
import pandas as pd
import numpy as np

In [11]:
d={'USN':[100,101,102],
 'name':['sam','ram','sri'],
 'mobile':[99,88,77],
 'marks':[10,9,8]
 }

In [12]:
std=pd.DataFrame(d)

In [13]:
print(std)

   USN name  mobile  marks
0  100  sam      99     10
1  101  ram      88      9
2  102  sri      77      8

In [15]:
std.head()

   USN name  mobile  marks
0  100  sam      99     10
1  101  ram      88      9
2  102  sri      77      8

In [16]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
USN       3 non-null int64
name      3 non-null object
mobile    3 non-null int64
marks     3 non-null int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [18]:
std.columns

Index(['USN', 'name', 'mobile', 'marks'], dtype='object')

In [19]:
std.isnull()

     USN   name  mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

accessing columns

In [20]:
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [22]:
std[['USN','name']]

   USN name
0  100  sam
1  101  ram
2  102  sri

accessing rows

In [23]:
std.iloc[2]

USN       102
name      sri
mobile     77
marks       8
Name: 2, dtype: object

In [24]:
std.loc[2]

USN       102
name      sri
mobile     77
marks       8
Name: 2, dtype: object

In [25]:
index = ['A','B','C']
std.set_index('USN')

    name  mobile  marks
USN
100  sam      99     10
101  ram      88      9
102  sri      77      8

    QN : Create a data frame cars with attributes car id , car name

In [29]:
cars={'car_id':[1,2,3,4,5],
 'name':['rollsroyce','rangerover','benz','bmw','lambhorgini']
 }

In [30]:
ra = pd.DataFrame(cars)

In [31]:
ra

   car_id         name
0       1   rollsroyce
1       2   rangerover
2       3         benz
3       4          bmw
4       5  lambhorgini

In [32]:
ra.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
car_id    5 non-null int64
name      5 non-null object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

to prove that isnull is true

In [34]:
f={'USN':[100,101,102],
 'name':['raj','ram','rajesh'],
 'mobile':[99,88,77],
 'marks':[10,None,None]
 }

In [35]:
td=pd.DataFrame(f)

In [36]:
td

   USN    name  mobile  marks
0  100     raj      99   10.0
1  101     ram      88    NaN
2  102  rajesh      77    NaN

In [37]:
td.isnull()

     USN   name  mobile  marks
0  False  False   False  False
1  False  False   False   True
2  False  False   False   True

In [38]:
std

   USN name  mobile  marks
0  100  sam      99     10
1  101  ram      88      9
2  102  sri      77      8

In [39]:
std['marks']<9

0    False
1    False
2     True
Name: marks, dtype: bool

In [40]:
newdf = std['marks']<9
std[newdf]

   USN name  mobile  marks
2  102  sri      77      8

In [44]:
newf=std['marks']>9
std[newf]

   USN name  mobile  marks
0  100  sam      99     10

In [45]:
std[newf]

   USN name  mobile  marks
0  100  sam      99     10

In [46]:
std[(std['USN']>101)|(std['marks']<40)]

   USN name  mobile  marks
0  100  sam      99     10
1  101  ram      88      9
2  102  sri      77      8

In [47]:
std[(std['USN']>101)&(std['marks']<10)]

   USN name  mobile  marks
2  102  sri      77      8

In [49]:
s='banglore,chennai,dmm'.split(',')
print(s)
print(type(s))

['banglore', 'chennai', 'dmm']
<class 'list'>

In [50]:
std['Address']=s

In [51]:
std

   USN name  mobile  marks   Address
0  100  sam      99     10  banglore
1  101  ram      88      9   chennai
2  102  sri      77      8       dmm

In [52]:
std.drop(2)

   USN name  mobile  marks   Address
0  100  sam      99     10  banglore
1  101  ram      88      9   chennai

In [53]:
d2={'USN':[None,101,102],
 'name':[None,None,'rajesh'],
 'mobile':[99,88,77],
 'marks':[35,33,None]
 }

In [54]:
d2

{'USN': [None, 101, 102],
 'name': [None, None, 'rajesh'],
 'mobile': [99, 88, 77],
 'marks': [35, 33, None]}